Add architecture doc
